{
    "blue_skies.blue_journal.turn_page": "Virar a Página",
    "blue_skies.blue_journal.back": "Voltar",
    "blue_skies.blue_journal.read_page": "Ler a Página",
    "blue_skies.blue_journal.tagline": "Guia de Aventureiro\npor Gatekeeper",
    "blue_skies.blue_journal.welcome": "Este diário foi escrito para ajudar os recém-chegados em suas jornadas pelos mundos de Everbright e Everdawn. Se alguma coisa tem uma funcionalidade única, é provável que já tenha escrito sobre isso neste livro. Você pode encontrar novas entradas de diário conforme avança, então lembre-se de verificar periodicamente. Eu marquei cada seção com um marcador na lateral do livro.",
    "blue_skies.section.search": "Pesquisar",
    "blue_skies.section.everbright": "Everbright",
    "blue_skies.section.everdawn": "Everdawn",
    "blue_skies.section.general": "Geral",
    "blue_skies.everbright.everbright_portal.title": "Portal para Everbright",
    "blue_skies.everbright.everbright_portal.lore": "A entrada para a dimensão de Everbright. O portal é feito de tijolos de pedra turquesa e pode ser aceso com um isqueiro Zeal. Parece que Everbright é constantemente dia, mas de alguma forma é sempre quebradiço e frio. O mundo é o lar de uma grande fauna de pelagem espessa. Muita neve e inimigos semelhantes a espíritos podem ser encontrados aqui. Durante a neve, mais inimigos gostam de mostrar o rosto, pois preferem o tempo mais frio.",
    "blue_skies.everbright.brewberry_bush.title": "Arbusto de Brewberry",
    "blue_skies.everbright.brewberry_bush.lore": "Folhagem encontrada em Everbright. Quando cultivada, ela produz Amoras. Após uma investigação mais aprofundada, o tipo de Amora que o arbusto possui pode ser influenciado com base no bloco em que você o cultiva, no entanto, não parece garantir que você receba a referida baga. Grama de Cereja faz com que o arbusto seja capaz de produzir Amoras rosa, que garantem a você uma pequena quantidade de regeneração. Cultivá-lo em Micélio parece permitir que ele cresça Amoras Negras, que curam os efeitos do status venenoso. Também descobri que o cultivo de arbustos em solo fértil, como Terra Arada ou Podzol, permitia que o arbusto produzisse uma fruta extra ou algo assim.",
    "blue_skies.everbright.snowcap_mushroom.title": "Cogumelo Chapéu-Nevado",
    "blue_skies.everbright.snowcap_mushroom.lore": "Como este mundo é muito mais frio, as fontes de calor são mais difíceis de encontrar. No entanto, graças a alguns dos meus experimentos, consegui descobrir que algumas plantas podem ser usadas como combustível. O mais notável é o Cogumelo Chapéu-Nevado. Ele absorve o calor, fazendo com que as redondezas sejam geladas ao toque. Ocasionalmente, pode atingir uma temperatura tão baixa que a lava endurece no local. E acontece que esse calor pode ser liberado em uma fornalha para produzir uma chama semelhante à do carvão.",
    "blue_skies.everbright.snowcap_pinhead.title": "Snowcap Pinhead",
    "blue_skies.everbright.snowcap_pinhead.lore": "Uma pequena variação do Cogumelo Chapéu-Nevado. Ele pode ser comprimido em blocos de cogumelos gigantes, que, assim como o Cogumelo Chapéu-Nevado, podem ser usados ​​como uma fonte de combustível.",
    "blue_skies.everbright.snowcap_oven.title": "Snowcap Oven",
    "blue_skies.everbright.snowcap_oven.lore": "Com esta criação, fui capaz de aproveitar a energia de aquecimento e resfriamento do Cogumelo Chapéu-Nevado. Ao tirar o calor de objetos quentes, ele pode cozinhar tudo o que você colocar dentro, ocasionalmente deixando o subproduto congelado do combustível para trás. Ele até permite que coisas como água sejam usadas como fonte de combustível, embora não seja uma fonte muito boa.",
    "blue_skies.everbright.brumble.title": "Brumble",
    "blue_skies.everbright.brumble.lore": "Uma das poucas vegetações oceânicas que podem ser encontradas em Everbright. Sua cor vermelha desbotada da um contraste muito bem com o resto do oceano, é muito interessante ver essa cor misturada entre os azuis e roxos de Everbright. Tenho certeza de que isso poderia ser fundido para criar belos materiais de construção.",
    "blue_skies.everbright.taratite.title": "Taratite",
    "blue_skies.everbright.taratite.lore": "Uma pedra lisa de cor azul esverdeada quase mentolada. Se for polido, tenho certeza de que será um ótimo material de construção.",
    "blue_skies.everbright.rimestone.title": "Pedra Gelada",
    "blue_skies.everbright.rimestone.lore": "Uma pedra gelada áspera. Se for polido, tenho certeza de que será um ótimo material de construção.",
    "blue_skies.everbright.ventium.title": "Ventium",
    "blue_skies.everbright.ventium.lore": "Um metal vermelho, pode ser encontrado na maioria dos biomas não montanhosos de Everbright. Parece assumir principalmente o papel de um equivalente de ferro neste mundo. Ventium pode ser usado para criar coisas como baldes, tesouras e a caixa de ferramentas.",
    "blue_skies.everbright.falsite.title": "Falsite",
    "blue_skies.everbright.falsite.lore": "Este metal mágico pode ser encontrado dentro dos biomas não montanhosos de Everbright. Possui propriedades misteriosas que permitem aumentar a durabilidade de quase todas as ferramentas, tanto de Everbright quanto de Everdawn, usando uma caixa de ferramentas.",
    "blue_skies.everbright.pearl.title": "Pérola",
    "blue_skies.everbright.pearl.lore": "Obtido da boca de um Seclam. Esta pérola brilhante parece ter algum tipo de propriedade misteriosa. A maioria dos inimigos parece não gostar que eu o segure. Posso ser capaz de combiná-lo com Falsite para criar algo maior.",
    "blue_skies.everbright.warding_pearl.title": "Pérola Protetora",
    "blue_skies.everbright.warding_pearl.lore": "Ao combinar uma pérola de Seclam e um Fragmento de Alma com Falsita para criar isso, sou capaz de evitar que mobs hostis apareçam em um grande raio. Isso é muito útil neste mundo, uma vez que fontes de luz como Moonstone não evitam que os mobs apareçam como fazem no mundo superior.",
    "blue_skies.everbright.soul_fragment.title": "Fragmento de Alma",
    "blue_skies.everbright.soul_fragment.lore": "Um fragmento de uma alma má. Com todos os inimigos fantasmagóricos em Everbright, esses são itens bastante comuns. Uma das maneiras de usar seu poder é criando uma pérola e um pouco de Falsita para criar uma Pérola Protetora. Considerando o quão cedo eu descobri isso em minha jornada, provavelmente há mais usos que ainda não descobri.",
    "blue_skies.everbright.azulfo_horn.title": "Chifre de Azulfo",
    "blue_skies.everbright.azulfo_horn.lore": "O chifre do poderoso Azulfo. Como a maioria dos ossos, eu sou capaz de criar farinha de osso a partir deles. Isso me permite fazer farm significativamente mais rápido.",
    "blue_skies.everbright.summoning_table.title": "Mesa de Invocação",
    "blue_skies.everbright.summoning_table.lore": "Depois de visitar a Masmorra Cegante, consegui colocar minhas mãos na Mesa de Invocação. Como tive a sorte de obter isso, posso usá-lo para alterar o modo do meu recém-descoberto Tomo de Invocação. Ele tem a opção de atirar em uma esfera flutuante ou convocar um Golem artificial para lutar ao meu lado. Provavelmente escreverei mais detalhadamente sobre a tomada em uma entrada separada.",
    "blue_skies.everbright.soulbound_spear.title": "Soulbound Spear",
    "blue_skies.everbright.soulbound_spear.lore": "Quando visitei a Masmorra Cegante de Everbright, encontrei uma Lança Presa à Alma. Esta lança parecia funcionar como uma lança normal, no entanto, sempre voltava para mim depois de jogá-la. Isso pode ser útil ao lidar com a maioria dos inimigos neste mundo.",
    "blue_skies.everbright.summoning_tome.title": "Tomo de Invocação",
    "blue_skies.everbright.summoning_tome.lore": "Entre as outras ferramentas úteis que consegui para mim mesmo na Masmorra Cegante de Everbright, consegui obter o Tomo de Invocação incomum. Isso me permite lançar alguns dos feitiços do Invocador. Quando obtive o tomo, imediatamente ele tinha a habilidade de conjurar uma esfera flutuante. Usando-o, posso atingir vários inimigos ao mesmo tempo com um único projétil, pois causa danos a qualquer coisa dentro de um raio dele. No entanto, uma vez que usei o tomo na Mesa de Convocação, fiquei surpreso ao ver que ele tinha mais uma habilidade! Isso me concedeu a habilidade de invocar um Golem Artificial para lutar ao meu lado. O Golem parecia ser temporário, porém, durando apenas cerca de um minuto, então é melhor eu usá-lo com sabedoria!",
    "blue_skies.everbright.nature_dungeon.title": "Masmorra Natural",
    "blue_skies.everbright.nature_dungeon.lore": "Eu consegui tropeçar em uma estrutura de pirâmide verde gigante nos Pinheiros Cobertos de Neve. Depois de entrar, fui saudado por muitos de seus habitantes. Eles pareciam ser golens construídos inteiramente com a pedra da estrutura, mantidos juntos com Vinhas iluminadas pelas estrelas. Conforme eu estava chegando ao topo da masmorra, comecei a perceber que a qualidade de construção estava melhorando o tempo todo! Os andares inferiores pareciam estar muito envelhecidos e desgastados pelo tempo, enquanto os andares superiores estavam em condições quase imaculadas. Cada andar parece ter uma chave de masmorra, vou assumir que, assim como a Masmorra Cegante, há uma Pedra Angular no final dos túneis para usar. No entanto, devido a alguns rumores que ouvi, provavelmente não verei por mim mesmo. Decidi chamar essa estrutura gigante de §oMasmorra §oNatural§r.",
    "blue_skies.everbright.crushing_hammer.title": "Martelo de Esmagamento",
    "blue_skies.everbright.crushing_hammer.lore": "Parece que este martelo veio diretamente do próprio Starlit Crusher! Este poderoso martelo tem o poder de bater no chão, assim como dizem os rumores do Starlit Crusher. Isso machuca tudo ao meu redor quando eu o uso, fazendo com que cada inimigo voe para o alto! Essa coisa também tem um grande impacto, causando muitos danos corpo a corpo, mas parece ser muito pesada.",
    "blue_skies.everdawn.everdawn_portal.title": "Portal para Everdawn",
    "blue_skies.everdawn.everdawn_portal.lore": "A entrada para a Dimensão de Everdawn, criada com Lunar Stone Bricks e iluminada com um Zeal Lighter. Este mundo está sempre quente e úmido, mas a hora é sempre ao amanhecer. Os insetos prosperam aqui, especialmente durante a chuva, quando mais deles saem de casa. Os insetos cresceram para tamanhos assustadores, alguns com cerca da metade do meu tamanho! A chuva parece menos pesada aqui, geralmente apenas uma garoa leve. A fauna aqui parece ser principalmente reptiliana, com poucas exceções.",
    "blue_skies.everdawn.baneful_mushroom.title": "Cogumelo Venenoso",
    "blue_skies.everdawn.baneful_mushroom.lore": "Ao explorar a Shaded Woodlands, tive que pisar com cautela. Do outro lado desta área, encontrei um cogumelo roxo aparentemente inofensivo. No entanto, após uma inspeção mais detalhada, ele tem propriedades tóxicas. O Cogumelo Venenoso reage ao contato borrifando qualquer coisa em cima dele com esporos tóxicos como mecanismo de defesa. Devo ter certeza de evitar esse cogumelo a todo custo.",
    "blue_skies.everdawn.crystal_flower.title": "Flor de Cristal",
    "blue_skies.everdawn.crystal_flower.lore": "Esta flor é interessante. É de alguma forma uma mistura de cristal e folhagem. Após uma inspeção mais detalhada, se fertilizado com algo como farinha de osso, é capaz de crescer e se tornar uma árvore completa!",
    "blue_skies.everdawn.spider_webbing.title": "Teia de Aranha",
    "blue_skies.everdawn.spider_webbing.lore": "Um tipo interessante de teia, tem a capacidade de se prender aos cantos, ao contrário das teias normais. Parece que só consegue se conectar a si mesmo ou a outras paredes.",
    "blue_skies.everdawn.crescent_fruit.title": "Fruta Crescente",
    "blue_skies.everdawn.crescent_fruit.lore": "Graças ao clima quente, Everdawn é capaz de nutrir algumas fontes de alimentos bastante tropicais, sendo as principais frutas crescentes. Eu descobri que esta fruta cresce na parte inferior de quase todas as folhas da Fruta Crescente e pode ser colhida aparentemente indefinidamente, desde que as folhas estejam em flor.",
    "blue_skies.everdawn.sunstone_crystal.title": "Cristal Sunstone",
    "blue_skies.everdawn.sunstone_crystal.lore": "Esses cristais são quentes ao toque, exibindo uma cor laranja brilhante. Eles podem ser usados ​​como combustível em qualquer fornalha, bem como uma forma de carregar a Forja de Horizonite. Eles podem ser encontrados nas profundezas da Floresta de Sunset Maple e nas Searing Grasslands.",
    "blue_skies.everdawn.horizonite_forge.title": "Forja de Horizonite",
    "blue_skies.everdawn.horizonite_forge.lore": "Eu consegui! Eu aproveitei o poder do Horizonite! Com isso, sou capaz de fundir coisas sem nenhum combustível. Isso vem com o custo do tempo de recarga. Ele pode ser carregado instantaneamente usando qualquer coisa composta de Horizonite. Também posso usar a Sunstone como outro meio de carregá-lo mais rápido. A Forja só recarregará se não houver nada cozinhando dentro dela. Ter vários desses provavelmente seria muito benéfico.",
    "blue_skies.everdawn.cinderstone.title": "Cinderstone",
    "blue_skies.everdawn.cinderstone.lore": "Esta pedra semelhante a magma poderia definitivamente ser usada como um bom material de construção. Tenho certeza de que pode ser polido em algo bom também.",
    "blue_skies.everdawn.umber.title": "Umber",
    "blue_skies.everdawn.umber.lore": "Uma pedra marrom lisa. Isso provavelmente poderia ser polido em um material de construção ainda mais liso.",
    "blue_skies.everdawn.crystallized_tree.title": "Árvore Cristalizada",
    "blue_skies.everdawn.crystallized_tree.lore": "Esta árvore tem propriedades incrivelmente estranhas. Não pode ser feito em gravetos e não queima. A madeira parece ser inteiramente feita de cristal, é até transparente. Com suas propriedades, tenho certeza de que as toras podem ser transformadas em paredes. Isso seria uma ótima substituição da cerca. Uma vez que a árvore não é exatamente folhagem pura, ela não tem mudas. Eu descobri que as flores de cristal, se fertilizadas com farinha de osso, podem se transformar em uma dessas árvores se plantadas em sua areia nativa.",
    "blue_skies.everdawn.horizonite.title": "Horizonite",
    "blue_skies.everdawn.horizonite.lore": "Encontrado nas Dunas de Cristal, este metal é extremamente quente, não acredito que não derrete! Não tenho certeza de como ele armazena tanto calor. Descobri que qualquer ferramenta criada a partir dele é capaz de fundir minérios diretamente da pedra! Também consegui criar um forno com esse material, que decidi chamar de Forja de Horizonita.",
    "blue_skies.everdawn.moonstone_shield.title": "Escudo de Moonstone",
    "blue_skies.everdawn.moonstone_shield.lore": "Este escudo é um pouco mais durável do que um escudo de madeira normal, ele também tem uma aparência transparente como o Vitrous Moonstone, permitindo que você veja as coisas através dele.",
    "blue_skies.everdawn.fox_pelt.title": "Pele de Raposa",
    "blue_skies.everdawn.fox_pelt.lore": "Obtido das Raposas Cósmicas, pode ser usado para criar Camel Saddles e a Bag of Spoils.",
    "blue_skies.everdawn.spike_shield.title": "Escudo de Espinhos",
    "blue_skies.everdawn.spike_shield.lore": "Após minha visita a Masmorra Cegante de Everdawn, fui capaz de obter um Escudo de Espinhos para mim. Este escudo é um pouco mais durável do que o escudo de madeira e o escudo de Pedra da Lua. Este escudo parece ter algum dano extra corpo a corpo, então ele pode dobrar como uma arma mais fraca.",
    "blue_skies.everdawn.alchemy_table.title": "Mesa de Alquimia",
    "blue_skies.everdawn.alchemy_table.lore": "Durante minha visita a Masmorra Cegante de Everdawn, eu tive sorte o suficiente para colocar minhas mãos na Mesa de Alquimia do Alquimista. Esses são bastante incomuns hoje em dia, então estou feliz por ter conseguido um. Usando isso, posso mudar a maioria dos materiais Everdawn brutos por Everbright e vice-versa. Pude ver isso sendo especialmente útil durante a construção. Se eu quisesse, poderia transformar a Pedra Lunar em Pedra Turquesa se a tivesse em abundância. Parece que também posso combinar pedra com meu Arco, o que me permite obter pedras da masmorra. Tenho certeza de que isso vai funcionar com os outros arcos, só não os tenho ...",
    "blue_skies.everdawn.alchemy_scroll.title": "Pergaminho de Alquimia",
    "blue_skies.everdawn.alchemy_scroll.lore": "Seguindo minha exploração da Masmorra Cegante de Everdawn, contra todas as probabilidades obtidas de um Pergaminho de Alquimia, o tesouro mais raro da Masmorra. Usando isso, posso imitar os feitiços de Espinho Decadente do Alquimista. Ela evoca Picos Decadentes em uma linha acima de mim, para onde quer que eu aponte. Também posso usar a segunda variação do ataque agachando-me, o que cria os espinhos voltados para cima ao meu redor, jogando os inimigos próximos para longe.",
    "blue_skies.everdawn.poison_dungeon.title": "Masmorra Envenenada",
    "blue_skies.everdawn.poison_dungeon.lore": "Durante minha exploração na Sunset Maple Forest, consegui localizar uma árvore de aparência estranha. Estava coberto de teias e, para minha surpresa, dentro dele havia um ninho de aranha gigante! Este lugar é o lar de muitas Aranhas Venenosas. Eu também fiquei surpreso ao ver que a aranha da caverna do Mundo Superior fez o seu caminho para este ninho. Cada andar tem uma chave de calabouço, presumo que, assim como a Masmorra Cegante, há uma Pedra Angular (keystone) no final dos túneis para usar. Eu posso ouvir o que soa como um assobio alto pelos corredores deste lugar, não posso imaginar o que é no final ... Acho que vou chamar este lugar de §o Masmorra Venenosa.",
    "blue_skies.everdawn.venom_sac.title": "Saco de Veneno",
    "blue_skies.everdawn.venom_sac.lore": "Após minha viagem pelo Masmorra Envenenada, consegui obter um Venom Sac. Com isso, posso disparar jatos de veneno, assim como dizem que o Aracnarca faz. O dano que o projétil inflige é mínimo, mas também infecta a vítima com um veneno mortal.",
    "blue_skies.everdawn.different_sword.title": "Espada Diferente",
    "blue_skies.everdawn.different_sword.lore": "Uma espada muito interessante, destinada a um combate rápido. Esta arma parece ter sido concebida com a intenção de matar o alvo o mais rapidamente possível. Se eu esperasse muito tempo depois de atingir o alvo, eles curariam mais danos do que eu. Sabendo disso, é provável que seja uma boa ideia evitar usá-lo em destinos mais volumosos.",
    "blue_skies.general.blinding_dungeon.title": "Masmorra Cegante",
    "blue_skies.general.blinding_dungeon.lore": "Em minhas viagens, consegui encontrar uma estrutura de torre gigante. Decidi apelidá-la de §oMasmorra §oCegante§r. Parece que esta masmorra tem 2 variações, uma no Everbright e outra no Everdawn. Ambos são o lar de Illagers. O Everbright tem o Invocador, e o Everdawn tem o Alquimista. Os dois podem ser visitados trazendo 4 chaves Masmorra Cegante para a pedra angular (keystone) no último andar de suas respectivas masmorras. Eu mesmo não pretendo começar uma briga muito forte com nenhum deles.",
    "blue_skies.general.moonstone.title": "Moonstone",
    "blue_skies.general.moonstone.lore": "Encontrado no subsolo em ambos os mundos, parece ser puramente uma fonte de luz. Funciona embaixo d'água e pode ser transformado em blocos maiores que também emitem luz. Ele também tem uma variação de cristal encontrada em algumas das cavernas desses mundos. Não acredito que faça algo especial como o cristal de Sunstone faz, mas parece bastante bonito.",
    "blue_skies.general.pyrope.title": "Pyrope",
    "blue_skies.general.pyrope.lore": "Esta gema pode ser encontrada em qualquer lugar subterrâneo em qualquer mundo. Parece que as ferramentas criadas com esse material são muito leves, então posso usá-las muito rápido. No entanto, essas ferramentas não parecem ser muito duráveis, então é melhor usá-las com cuidado. Devido à maciez deste material, ele não pode coletar os melhores materiais para equipamentos desses mundos, como Diopside e Charoite.",
    "blue_skies.general.aquite.title": "Aquite",
    "blue_skies.general.aquite.lore": "Este minério azul água parece ser semelhante ao ferro do Mundo Superior no que diz respeito a ferramentas e armaduras. Depois de alguma experimentação, parece muito encantador ainda por cima.",
    "blue_skies.general.diopside.title": "Diopside",
    "blue_skies.general.diopside.lore": "Esta gema pontiaguda, de formato quase cristalino, tem uma cor verde-limão. Eu achei muito profundo no subsolo em ambos os mundos. A armadura e as ferramentas criadas com este material são §oexageradamente§r duráveis ​​e fortes. As ferramentas são muito pesadas e causam danos extremos a qualquer coisa que eu acerte. Algo a se notar, porém, devido ao seu peso, são muito mais difíceis de balançar do que a maioria das ferramentas. Terei que ter cuidado ao lidar com alvos rápidos. Este conjunto de equipamentos concorre com Charoite. As armas são mais lentas, mas mais duráveis ​​e alternativas de ataque mais difícil, enquanto a armadura lida com golpes mais pesados ​​melhor do que Charoite. Ferramentas feitas com esse material podem colher tudo o que descobri nesses mundos até agora.",
    "blue_skies.general.charoite.title": "Charoite",
    "blue_skies.general.charoite.lore": "Um conjunto mais neutro de armadura e ferramentas, sendo semelhante ao diamante do Mundo Superior em muitos aspectos. Este conjunto de equipamentos compete com Diopside. As ferramentas são mais rápidas, mas alternativas mais fracas, enquanto a armadura lida com golpes mais leves melhor do que o Diopside. Ferramentas feitas desse material podem colher tudo o que descobri nesses mundos até agora.",
    "blue_skies.general.star_emitter.title": "Emissor Estelar",
    "blue_skies.general.star_emitter.lore": "Geralmente acompanhado por um villager que trabalha como Stargazer. Este dispositivo interessante pode colocar o Astrolábio em uso. Usar um Astrolábio no objeto permitirá ao usuário se teletransportar de volta para sua posição. Escreverei uma descrição mais detalhada do Astrolábio em sua própria entrada.",
    "blue_skies.general.trough.title": "Gamela",
    "blue_skies.general.trough.lore": "Uma calha de madeira simples. Se os filhotes estiverem perto dele, eles terão a chance de comer dele. Quando um animal comer do bloco, isso permitirá que ele cresça mais rápido. Ele pode ser preenchido com a maioria dos itens de criação de animais, como cenouras, batatas, scalefruit e pine fruit. Se um villager decidir trabalhar aqui, ele será um Wrangler.",
    "blue_skies.general.tool_box.title": "Caixa de Ferramentas",
    "blue_skies.general.tool_box.lore": "Esta mesa de trabalho é muito útil, pode ser usado para aprimorar e atualizar ferramentas. Este parece ser o uso principal do Falsite, pode aumentar a durabilidade quando colocado junto com quase qualquer ferramenta desses mundos. Outra descoberta: qualquer graveto desses mundos pode ser trocado por qualquer ferramenta. Parece que quase todos os gravetos têm usos diferentes, terei que ver quais funcionam bem em cada conjunto de ferramentas.",
    "blue_skies.general.bag_of_spoils.title": "Saco de Espólios",
    "blue_skies.general.bag_of_spoils.lore": "Uma pequena bolsa que pode transportar quase tudo, e pode conter no máximo 5 itens diferentes dentro dela. Eu descobri que poderia roubar qualquer aldeão agachando-me e usando-o neles enquanto eles não estavam olhando. Sempre que eles me viam fazer isso, como esperado, eles ficariam bastante infelizes, até mesmo o Golem de Ferro da vila me atacou. O único indivíduo que não consegui mexer no bolso foi o Nightwatcher, que primeiro me deu a bolsa. nem preciso dizer que não irei visitar ESSA vila de novo né?",
    "blue_skies.general.food_prep_table.title": "Mesa de Preparação de Comida",
    "blue_skies.general.food_prep_table.lore": "Uma mesa feita para preparar refeições. Pode aceitar no máximo 5 ingredientes, sendo 3 o mínimo necessário para criar um prato adequado. Usando muitos ingredientes exclusivos, sou capaz de fazer refeições melhores do que o normal. Quanto mais saudáveis ​​os ingredientes, mais porções a refeição terá. Sabendo disso, usar carne parece ser o mais benéfico para fazer minha comida durar mais.\n\nAo incorporar flores como uma espécie de tempero, parece possível prolongar seus efeitos de poção latentes. Já ouvi falar de pessoas no mundo superior fazendo isso para fazer ensopados, embora tenha certeza de que meus métodos são superiores.\n\nPara um efeito mais duradouro ou mais potente, Poções também podem ser usadas como um molho. Embora pareça que só posso usar um sem causar instabilidade...\n\nPor meio da experimentação, descobri que usar uma Brewberry pode realçar o sabor de todos os efeitos, estendendo sua duração. É possível fazer um prato puramente baseado em ingredientes que concedem efeitos. Fazer isso não deixará o prato muito recheado, mas pode ser exatamente o que eu preciso em algumas situações. Embora eu não reclamasse se pudesse encontrar uma flor que realce o sabor da minha comida.",
    "blue_skies.general.astrolabe.title": "Astrolábio",
    "blue_skies.general.astrolabe.lore": "Consegui encontrar este item útil negociando com um dos Observadores Estelares locais da vila. Ao combinar este item com um Emissor Estelar, posso me teletransportar uma distância moderada pelo mundo para retornar a ele. No entanto, isso não é algo que eu possa usar constantemente, já que o poder do Astrolábio terá que ser recarregado por um tempo em relação à distância de onde eu me teletransportei.",
    "blue_skies.general.spears.title": "Lanças",
    "blue_skies.general.spears.lore": "Ferramentas incrivelmente úteis projetadas para ferir alvos à distância. Eles funcionam como uma mistura do tridente e do arco do Overworld, sendo baratos de fazer e utilizáveis ​​debaixo d'água. Descobri que as lanças podem ser encantadas com coisas como lealdade e perfuração.",
    "blue_skies.general.stick_variations.title": "Variações do Graveto",
    "blue_skies.general.stick_variations.lore": "Hoje eu fiz uma descoberta incrível. Descobri que as variações de madeira desses mundos têm propriedades diferentes, às vezes devido à idade ou às condições de vida de suas árvores. Essas propriedades são transferidas para os gravetos criados com a madeira, o que significa que posso alterar as propriedades de qualquer ferramenta que fizer!\n\nComeçando com as variações mais básicas, sendo Bluebright e Lunar. Estes são os mais semelhantes ao tipo de graveto típico do Overworld. As ferramentas exibem suas propriedades normais, com peso e força médios. Se quero algo confiável, sei que posso contar com esses gravetos.\n\nAgora nos mais interessantes, Frostbright e Maple. Essas variações de madeira são incrivelmente densas e pesadas. Ferramentas com gravetos feita de qualquer uma dessas variações de madeira serão muito mais duráveis, ao custo de torná-las mais difíceis de balançar nos alvos. Sabendo disso, é melhor colocar ambos os gravetos em ferramentas do que em armas. Isso também afeta as lanças, tornando-as mais difíceis de arremessar, mas são mais duráveis.\n\nPor último, há Starlit e Dusk. Essas variações de madeira parecem ser as mais antigas dos mundos. Eles são muito leves e frágeis. Não consigo imaginar que as ferramentas construídas com isso durem muito tempo...Achei que fazer armas valeu a pena, pois as torna muito mais fáceis de balançar e, no caso das lanças, muito mais fáceis de lançar.\n\nNa verdade, existe mais um tipo de graveto, o mais raro deles, Cherry. Esta variação de madeira indescritível é quase inteiramente uma atualização direta para o Frostbright e Maple mencionados anteriormente. Sua força adicional não adiciona mais peso do que os outros, mas é um pouco mais durável.",
    "blue_skies.general.arcs.title": "Arcos",
    "blue_skies.general.arcs.lore": "No folclore das pessoas que habitam esses mundos, há menção a artefatos lendários conhecidos como Arcos. Há rumores de que esses artefatos são mantidos apenas pelos protetores de cada estrutura de masmorra nesses mundos. Diz-se que cada arco concede poderes especiais a quem o carrega.",
    "blue_skies.general.enchanting.title": "Encanto",
    "blue_skies.general.enchanting.lore": "Assim como nos outros mundos, o encanto é possível de dentro de Everbright e Everdawn. Para fazer isso apenas dentro desses mundos, você precisaria coletar Charoite, que serve ao mesmo propósito do Diamante, Obsidiana de Everdawn e Falsite de Everbright.\n\nDescobri que o Falsite tem propriedades semelhantes ao lápis-lazúli quando usado na Mesa de Encantamento como um catalisador, no entanto, um lingote completo é demais para esse processo. Ao transformar o lingote em pepitas, posso usá-lo como faria com o Lápis.",
    "blue_skies.everbright.azulfo.title": "Azulfo",
    "blue_skies.everbright.azulfo.lore": "O maior da fauna de Everbright. Encontrei muitos deles ao longo de minha jornada. Eles podem ser encontrados em grandes rebanhos e geralmente seguem o líder do rebanho. Caçá-los pode ser bastante difícil, pois, ao contrário dos animais do mundo superior, eles não morrem sem lutar. Na verdade, todo o rebanho ficará irritado quando você fizer isso. Descobri que as lanças tendem a ser a ferramenta mais útil que você pode usar para caçá-los com segurança.",
    "blue_skies.everbright.stardust_ram.title": "Carneiro Estelar",
    "blue_skies.everbright.stardust_ram.lore": "Fauna mais comum de Everbright. Essas criaturas lanosas são muito semelhantes às ovelhas do mundo superior. Eles podem ser tosados ​​com tesouras e caçados para carneiro. Essas criaturas podem ser criadas usando a safra mundial de pinheiros.",
    "blue_skies.everbright.reindeer.title": "Rena",
    "blue_skies.everbright.reindeer.lore": "A rena é um dos animais mais úteis que encontrei em Everbright. Podem ser domesticados com pine fruit e equipados com sela. Eles podem ser montados a uma velocidade moderadamente rápida e podem pular cerca de 2 blocos de altura. Só consegui encontrar essas criaturas em áreas abertas com neve, como Brightlands e Snow Covered Pines. As renas também podem ser caçadas para a caça, no entanto, com seus climas mais exigentes, geralmente evito fazer.",
    "blue_skies.everbright.snow_owl.title": "Coruja da Neve",
    "blue_skies.everbright.snow_owl.lore": "Essas lindas criaturas sonoras só podem ser encontradas na Frostbitten Florest. Eles geralmente vivem no topo das árvores do bioma. Eles podem ser ouvidos de grandes distâncias, o que aumenta a sensação misteriosa da Floresta Congelada.",
    "blue_skies.everbright.grittle_flatfish.title": "Grittle Flatfish",
    "blue_skies.everbright.grittle_flatfish.lore": "Sendo uma das criaturas peixes mais originais nos oceanos, o Grittle Flatfish é muito arisco. Tende a se assustar com muita facilidade, atacando quem quer que se aproxime e fugindo logo em seguida. Não dói muito, mas não posso deixar de me sentir mal pela pequena coisa que sempre consigo assustar um. Esses peixes são uma iguaria e tendem a me encher mais do que qualquer outro peixe.",
    "blue_skies.everbright.armored_frost_spirit.title": "Espírito de Gelo Blindado",
    "blue_skies.everbright.armored_frost_spirit.lore": "O Espirito de Gelo é um dos inimigos mais comuns que encontrei em minha jornada. Essas criaturas não são exatamente o que parecem, podem parecer agressivas e raivosas, mas por baixo desse gelo todo está um pequeno espírito que não poderia machucar uma mosca. Uma vez liberado, ele tentará escapar, provavelmente evitando a maioria dos ataques que você fará em direção a ele. Depois de morto, você pode conseguir um ou dois fragmentos de alma. Descobri que usar qualquer picareta causa mais danos ao seu corpo gelado, geralmente matando-o mais rápido do que minhas espadas mais fracas.",
    "blue_skies.everbright.crynocerous.title": "Crynocerous",
    "blue_skies.everbright.crynocerous.lore": "Eu não via isso com muita frequência, o Crynocerous parece ser uma versão muito maior e mais poderosa do Espirito de Gelo Blindado, compartilhando muitas das mesmas qualidades. Ele tem mais alcance e força do que o Espirito de Gelo Blindado tem. Só consegui encontrar essa fera em climas de neve, como Brightlands. Assim como o espírito do gelo, ele sofre mais dano quando acertado com uma picareta do que com uma espada.",
    "blue_skies.everbright.polargeist.title": "Polargeist",
    "blue_skies.everbright.polargeist.lore": "Em minha jornada, encontrei um urso fantasmagórico. Esta criatura é surpreendentemente rápida, sendo capaz de me ultrapassar na maioria dos casos. Ele tem gelo pendurado em sua barriga e tem presas feitas de gelo. Quando ele ataca, ele fica de pé sobre as duas pernas e acerta o alvo. Descobri que ele não atacará se você bater para trás com rapidez suficiente, pois leva tempo para se levantar.",
    "blue_skies.everbright.whistleshell_crab.title": "Whistleshell Crab",
    "blue_skies.everbright.whistleshell_crab.lore": "Este grande caranguejo é capaz de andar tanto na terra quanto na água. Parece que sua garra quase se assemelha a uma boca com dentes. Em terra, é muito rápido e quase não dá tempo para fugir. Embora tenham muita velocidade, eles não têm muito alcance, então é fácil evitar ataques em terra. Na água é um pouco mais lento, mas é capaz de se lançar na água quando aterrado. A maneira mais segura de tirar na água é ficar alto, já que não sabe nadar.",
    "blue_skies.everbright.shrumpty.title": "Shrumpty",
    "blue_skies.everbright.shrumpty.lore": "Muitas vezes, quando eu explorava Slushlands, me assustava com um Shrumpty. Esses caras sorrateiros se camuflam com os cogumelos chapéu-nevado e atacam quando um predador está próximo. Seu toque é muito frio, fazendo com que seus alvos congelem e diminuam a velocidade. Eles até riem assustadoramente quando conseguem acertar um ataque, muito estranho...",
    "blue_skies.everbright.diophyde_prowler.title": "Diophyde Prowler",
    "blue_skies.everbright.diophyde_prowler.lore": "Entre os muitos inimigos que enfrentei em Everbright, não há nenhum semelhante ao Diophyde Prowler. Este inimigo circunda sua presa, atacando quando chegar a hora certa. Descobri que a maneira mais fácil de evitar seus ataques é metralhar no sentido oposto ao do movimento. É tão rápido que não há sentido em fugir, vale mais a pena apenas lutar. Eu também descobri que usar um dos escudos de Everdawn pode pará-lo em seu caminho, deixando-o vulnerável a ataques.",
    "blue_skies.everbright.seclam.title": "Seclam",
    "blue_skies.everbright.seclam.lore": "Ocasionalmente, quando eu atravessar os oceanos profundos de Everbright, eu posso encontrar um Seclam. Essas criaturas calmas não se movem, em vez disso apenas exibem sua bela pérola. Sempre que um possível predador se aproximar, o molusco fecha a boca, impedindo que qualquer coisa roube sua pérola brilhante. Descobri que, depois de bater algumas vezes, ela se abriria e eu poderia tirar a pérola de sua boca com segurança. Eu tinha que ter cuidado, no entanto, se fosse muito lento, ele se fecharia em mim, o que provavelmente doeria muito.",
    "blue_skies.everbright.stonelet.title": "Stonelet",
    "blue_skies.everbright.stonelet.lore": "Durante minha visita a Masmorra Natural, encontrei muitos desses inimigos de aparência estranha. Estes são os protetores da masmorra, atacando qualquer um que ouse invadir a mesma. Eu descobri que, assim como o espírito do gelo, essas criaturas são feridas mais por picaretas do que por qualquer outra coisa. Sabendo disso, fui facilmente capaz de atravessar a masmorra.",
    "blue_skies.everbright.spewter.title": "Spewter",
    "blue_skies.everbright.spewter.lore": "Durante minha exploração da Masmorra Natural, encontrei essas criaturas vegetais interessantes crescendo nos jardins do último andar. Eles cuspiam bombas de sementes em mim sempre que eu chegava perto deles, então tive que manter distância.",
    "blue_skies.everbright.summoner.title": "Invocador",
    "blue_skies.everbright.summoner_pre.lore": "No topo da Masmorra Cegante de Everbright, entrei em uma luta com um indivíduo que usava um casaco roxo com colarinho. Ele havia usado seus poderes mágicos para invocar golens compostos da pedra da masmorra. Descobri que na maioria das vezes que me aproximava desse feiticeiro, ele se teletransportava para outra seção da sala. Eu percebi, entretanto, se ele estivesse lançando um feitiço, eu poderia me aproximar com segurança, possivelmente sendo capaz de desferir um golpe. Eu fui capaz de entender que se eu mantivesse a contagem de golens menor do que o que ele convocou, mas maior do que 1, ele começaria a conjurar mais. Usei isso como meu tempo para atacar. Infelizmente, minha visita à masmorra foi interrompida porque meu poder foi superado por esse indivíduo, então tive que escapar mais cedo.",
    "blue_skies.everbright.summoner_post.lore": "Depois de combinar meu próprio conhecimento de primeira mão com alguns dos contos dos habitantes locais, posso finalmente escrever uma descrição mais detalhada sobre a quem os habitantes locais chamam, o Invocador. Este feiticeiro vive no topo da Masmorra Cegante de Everbright. Ao contrário do Alquimista, o Invocador usa suas invocações para lutar por ele. Ele pode usar magia para primeiro convocar golems de longo alcance que disparam projéteis contra quem ousa entrar no último andar. Isso é seguido por vários golens mais orientados para o combate corpo a corpo, também atacando o invasor. Esses golens são conhecidos como Golens Artificiais. O indivíduo tende a preferir manter vários Golens Artificiais por perto. O Invocador também se teletransporta para um local seguro se for abordado sem lançar um feitiço. Conhecendo esses fatos, ao derrotar alguns dos golens, o Invocador se deixará vulnerável a ataques enquanto invoca mais. Para um ataque mais geral, o Invocador usa bolas de magia conhecidas como Esferas Flutuantes para acertar qualquer coisa que possa chegar perto dele. Algo que deve ser conhecido, porém, é que se abordado muito rapidamente ao lançar uma dessas esferas, o Invocador criará um poderoso raio estranho, trazendo fogo azul levitante para a mistura. Depois de aprender e reunir todas essas informações, não posso deixar de pensar que já conheci essa pessoa antes.",
    "blue_skies.everbright.starlit_crusher.title": "Starlit Crusher",
    "blue_skies.everbright.starlit_crusher_pre.lore": "Eu ouvi rumores sobre o lendário guardião da Masmorra Natural. Eles dizem que ele se protege com paredes de madeira gigantes e pode convocar outros inimigos semelhantes a plantas para ajudá-lo na batalha. Eu ouvi dizer que a única maneira que as pessoas encontraram de deixá-lo vulnerável é jogando algo com uma ponta afiada, como uma lança, depois de derrubar uma de suas paredes. Se fosse eu, quase com certeza gostaria de vir equipado com um machado para derrubá-lo.",
    "blue_skies.everbright.starlit_crusher_post.lore": "Finalmente aprendi o suficiente sobre o Starlit Crusher! Eu aprendi que ele usa 4 paredes para se proteger em batalha, protegendo-se de quaisquer ataques. Enquanto as paredes estão erguidas, o Crusher vai cultivar coisas como raízes, Spewters e Wooden Snow Owls para ajudá-lo na batalha. Depois de ter sofrido danos suficientes, as referidas raízes crescerão maiores em tamanho. Assim que uma das paredes for destruída, ele começará a quebrar o chão com raiva, ficando vulnerável a qualquer projétil, como uma lança. Uma vez atordoado, ele pode ser atacado com qualquer arma, entretanto um machado é considerado ideal para derrubá-lo.",
    "blue_skies.everdawn.cosmic_fox.title": "Raposa Cósmica",
    "blue_skies.everdawn.cosmic_fox.lore": "Um dos menores animais que encontrei em Everdawn foi a Raposa Cósmica. Consegui encontrar a criaturinha em áreas mais abertas, como os Campos Searing e o Vale pouco ortodoxo. Consegui domesticar o animal usando Crescent Fruits, e ele me seguiria aonde quer que eu fosse. Ele ainda ouve comandos!",
    "blue_skies.everdawn.crystal_camel.title": "Camelo de Cristal",
    "blue_skies.everdawn.crystal_camel.lore": "O lindo camelo de cristal. Localizada apenas em biomas arenosos, esta incrível criatura caminha pelo deserto, aproveitando o calor da região. Descobri que eles gostam de comer Scalefruit e fui capaz de domar um para mim. Depois de criar uma Sela de Camelo para mim, fui capaz de montá-la. Aprendi que posso montar um baú nas costas, o que me permite carregar muitos itens com facilidade. Um contra para isso, no entanto, é que os camelos não são exatamente os animais mais rápidos, então eu só conseguia me mover em um ritmo mais lento.",
    "blue_skies.everdawn.shade_monitor.title": "Monitor de Sombra",
    "blue_skies.everdawn.shade_monitor.lore": "Sendo o mais comum da fauna de Everdawn, este animal parece ser a principal escolha de caça neste mundo. Eles se adaptam a qualquer área em que estejam, tendo uma aparência camuflada diferente com base no bioma. Cuidado se você tentar caçar esses animais, pois eles não vão desistir sem lutar! Sua velocidade é incomparável por qualquer um dos outros animais em Everdawn. Eles não são tão poderosos quanto o Azulfo de Everbright, mas ainda doem um pouco se não forem equipados.",
    "blue_skies.everdawn.crogre.title": "crogre",
    "blue_skies.everdawn.crogre.lore": "Meu favorito pessoal, o Crogre. Uma rã gigante vivendo quase exclusivamente no Reservatório Enluarada. Eles saltam muito alto, saltando cerca de 4-5 blocos de altura. Os insetos gigantes de Everdawn parecem não gostar muito desse sujeito, geralmente fugindo assim que conseguem se aproximar. Descobri que eles gostam de consumir tripas de insetos, permitindo-me domesticar um para mim. Depois, consegui selar um e montá-lo! Descobri que também poderia pedalar na água, o que me permitiu atravessar o reservatório com facilidade por terra e água!",
    "blue_skies.everdawn.nyctofly.title": "Nyctofly",
    "blue_skies.everdawn.nyctofly.lore": "Uma das minhas maiores preocupações enquanto estava em Everdawn era o Nyctofly. O inseto nascido no ar vive em áreas densamente arborizadas, como Shaded Woodlands. Tem bastante atenção, sendo capaz de ver alvos a distâncias incríveis. Sempre que eu ouvia suas asas batendo, sabia que era hora de lutar. Uma grande coisa que aprendi é que pode ser muito mais difícil lutar em uma área aberta, então aconselho ficar em um espaço apertado.",
    "blue_skies.everdawn.venom_spider.title": "Aranha Venenosa",
    "blue_skies.everdawn.venom_spider.lore": "Um dos inimigos mais comuns que eu teria que enfrentar em Everdawn seria a Aranha Venenosa. Eles tendem a ser bastante inteligentes, mudando suas táticas de ataque com base em onde você está. Se eu decidisse ir direto para atacá-lo, ele tentaria me morder diretamente com suas presas venenosas. Se eu decidisse manter distância, ele cuspiria em mim com uma saliva venenosa. Usar um escudo me ajudou na maioria dos cenários ao lutar contra essas criaturas.",
    "blue_skies.everdawn.emberback.title": "Emberback",
    "blue_skies.everdawn.emberback.lore": "Essas criaturas gigantescas podem ser um desafio para lutar sem estar cientes de suas táticas de batalha. O Emberback pode ser encontrado voando em direção a seus alvos. Uma vez perto, o inseto vai cair, expelindo ar quente flamejante de sua concha. Esses insetos são muito espertos e podem detectar se você consumiu uma poção de resistência ao fogo e, em vez disso, tentarão mordê-lo para diminuir o dano causado. Uma maneira fácil de cuidar desses insetos é usando um escudo ou atraindo-os para um corpo d'água.",
    "blue_skies.everdawn.infested_swarmer.title": "Enxame Infestado",
    "blue_skies.everdawn.infested_swarmer.lore": "Este inseto indescritível só pode ser encontrado no subsolo, ou raramente acima do solo em áreas fortemente cristalizadas, como o Crystal Roughs. Essas formigas gigantes não têm muitas táticas de batalha, em vez disso, elas geralmente têm velocidade e tamanho. Quase me sinto mal pelo pobre coitado com o quão estranhamente ele se transformou.",
    "blue_skies.everdawn.nested_spider.title": "Aranha Aninhada",
    "blue_skies.everdawn.nested_spider.lore": "No final da minha jornada na Masmorra Envenenada, eu encontrei o que pareciam ser ninhos de aranha. Eu ocasionalmente veria uma aranha aninhada espreitar para fora, então presumo que é aqui que as aranhas menores descansam.",
    "blue_skies.everdawn.alchemist.title": "Alquimista",
    "blue_skies.everdawn.alchemist_pre.lore": "No topo da Masmorra Cegante de Everdawn, entrei em uma batalha com uma pessoa vestindo uma roupa vermelha com capuz. Ele usou magia para conjurar feixes de flechas e pedras pontiagudas feitas de pedra nativa do mundo. Parecia que os feixes de flechas podiam ser facilmente bloqueados com o uso de um escudo. Este personagem também foi capaz de lançar nuvens de poção nos cantos da sala, garantindo-lhe um lugar para fugir. Um padrão que pude notar é que todos os ataques que não consegui bloquear foram facilmente evitados. Parece que o ataque mais poderoso que ele tem à sua disposição são os espinhos, pois eles podem perfurar a armadura. Infelizmente, esta curta partida não foi a meu favor, então eu tive que escapar antes que pudesse aprender mais. Terei de falar com os habitantes locais para tentar obter mais informações.",
    "blue_skies.everdawn.alchemist_post.lore": "Depois de ouvir histórias dos habitantes locais, pude expandir meu conhecimento sobre quem eles apelidaram de Alquimista. O feiticeiro que se esconde no topo da Masmorra Cegante de Everdawn. Em contraste com o Invocador de Everbright, o Alquimista faz a maior parte da luta sozinho, jogando projéteis e usando ataques que cobrem uma grande área como nuvens de poção. Da mesma forma que o Invocador, o Alquimista pode escapar de qualquer coisa que possa se aproximar dele, teletransportando-se para longe. Ele não pode se teletransportar durante o lançamento de feitiços, no entanto, o que significa que toda vez que ele ataca, ele fica aberto.\n\nComeçando por mencionar os projéteis, em meu próprio encontro, descobri que Picos Decadentes podem perfurar armaduras e machucar um pouco. Infelizmente para o Alquimista, eles são muito fáceis de evitar. Se você se aproximar dele muito rapidamente, no entanto, eles aparecerão ao redor de seus pés, voltados para cima. Para o outro projétil, o Alquimista pode usar pacotes de flechas. Essas flechas têm um grande impacto e podem fazer você voar pela sala. Pelo que os habitantes locais disseram, conforme o Alquimista fica mais fraco, há uma chance de que algum seja incendiado. Felizmente, há fontes de água na sala durante a maior parte da luta. No entanto, isso pode mudar, pois ainda não mencionei outra habilidade que o Alquimista possui, a conversão de fluidos. O Alquimista é capaz de converter água em lava e vice-versa. Isso pode mudar o rumo da batalha rapidamente se você conseguir ser queimado por ele.\n\nAgora chegarei às últimas coisas que o Alquimista pode fazer. Ele é capaz de cegar temporariamente todos em sua sala, dizem que isso dura pouco tempo, então eu não me preocuparia muito. A última coisa que ele pode fazer é se curar quando estiver fraco. Como ele fica aberto para ataques o tempo todo, com armamento e agressividade adequados, sua cura pode ser anulada. Depois de ouvir todos esses rumores e juntar essas informações, não posso deixar de sentir que já conheci essa pessoa antes.",
    "blue_skies.everdawn.arachnarch.title": "Arachnarch",
    "blue_skies.everdawn.arachnarch_pre.lore": "Com alguns dos contos que ouvi sobre este aracnídeo gigante, eu ficaria com medo de enfrentá-lo sozinho. Pelo que entendi, ele é capaz de usar seu tamanho gigante para atacar qualquer um de seus alvos quando aterrado. Com o que aprendi com a maioria dos predadores de Everdawn, um escudo provavelmente faria maravilhas contra ele. Também ouvi dizer que, ao contrário da maioria das aranhas gigantes do mundo, esta é capaz de se agarrar ao teto para evitar a maioria dos ataques.",
    "blue_skies.everdawn.arachnarch_post.lore": "Com algumas informações recentes que aprendi, sou capaz de escrever uma entrada completa sobre o Arachnarch. Este rastejante assustador é capaz de se agarrar ao teto, mantendo-se longe da maioria, senão de todos os ataques. Nesta posição, ela parece estar mais na defensiva, atacar aqui não é eficaz. Se isso for verdade, eu aconselharia protelá-la até que ela não seja mais capaz de se manter no teto. Então, quando está de castigo, também ouvi que ela pode se lançar em direção a alvos usando sua enorme quantidade de peso. Como acontece com a maioria dos inimigos de Everdawn, eu tendo a usar um escudo contra inimigos como este. Pelo que entendi, a colisão com o escudo faz com que a aranha fique tonta, deixando-a vulnerável a ataques."
}